app/representers/ad_representer.rb

  def to_json
      {
        id: @ad.id,
        description: @ad.description,
        price: @ad.price,
        stage: @ad.stage,
        reason_for_rejection: @ad.reason_for_rejection,
        car_model: @ad.car.model.name,
        car_brand: @ad.car.model.brand.name,
        engine_capacity: @ad.car.engine_capacity,
        creation_year: @ad.car.creation_year,
        user_phone: @ad.user.phone,
        photos: @ad.photos.map{|photo| ({ photo: rails_blob_path(photo, only_path: true) })}
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]