app/controllers/api/v1/ads_controller.rb

      def create

        @car = Car.find_or_create_by(creation_year: car_params[:creation_year], engine_capacity: car_params[:engine_capacity], model_id: car_params[:model_id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."creation_year" = $1 AND "cars"."engine_capacity" = $2 AND "cars"."model_id" = $3 LIMIT $4  [["creation_year", 1996], ["engine_capacity", 2.5], ["model_id", 1], ["LIMIT", 1]]
INSERT INTO "cars" ("creation_year", "engine_capacity", "created_at", "updated_at", "model_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["creation_year", 1998], ["engine_capacity", 2.0], ["created_at", "2022-11-01 15:08:14.862325"], ["updated_at", "2022-11-01 15:08:14.862325"], ["model_id", 1]]