app/controllers/api/v1/brands_controller.rb

INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Audi"], ["created_at", "2022-10-19 11:14:38.088192"], ["updated_at", "2022-10-19 11:14:38.088192"]]
---
      def create
        @brand = Brand.new(brand_params)

        if @brand.save

UPDATE "brands" SET "name" = $1, "updated_at" = $2 WHERE "brands"."id" = $3  [["name", "Nissan"], ["updated_at", "2022-10-19 14:25:23.781795"], ["id", 202]]
---
      def update
        if @brand.update(brand_params)

DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 19]]
---
      def destroy
        @brand.destroy

SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
---
      def set_brand
        if @brand = Brand.find(params[:id])