app/controllers/api/v1/brands_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_brand
        if @brand = Brand.find(params[:id])